result/httpaf-fork-lwt-bigstring.log
Running 1m test @ http://localhost:8000/
  8 threads and 10000 connections
  Thread calibration: mean lat.: 468.928ms, rate sampling interval: 228ms
  Thread calibration: mean lat.: 449.152ms, rate sampling interval: 199ms
  Thread calibration: mean lat.: 446.171ms, rate sampling interval: 204ms
  Thread calibration: mean lat.: 362.348ms, rate sampling interval: 159ms
  Thread calibration: mean lat.: 448.287ms, rate sampling interval: 215ms
  Thread calibration: mean lat.: 447.251ms, rate sampling interval: 204ms
  Thread calibration: mean lat.: 378.565ms, rate sampling interval: 170ms
  Thread calibration: mean lat.: 458.583ms, rate sampling interval: 220ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   572.58ms    3.38s   36.50s    96.86%
    Req/Sec     3.72k   494.31     6.62k    70.79%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   18.48ms
 75.000%   25.61ms
 90.000%   37.82ms
 99.000%   21.27s 
 99.900%   33.69s 
 99.990%   35.95s 
 99.999%   36.50s 
100.000%   36.54s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       6.107     0.000000            1         1.00
      11.207     0.100000       130126         1.11
      13.191     0.200000       259831         1.25
      14.999     0.300000       389225         1.43
      16.735     0.400000       519893         1.67
      18.479     0.500000       648495         2.00
      19.439     0.550000       713415         2.22
      20.527     0.600000       778479         2.50
      21.823     0.650000       843121         2.86
      23.471     0.700000       907919         3.33
      25.615     0.750000       972612         4.00
      26.911     0.775000      1005141         4.44
      28.415     0.800000      1037581         5.00
      30.143     0.825000      1069969         5.71
      32.127     0.850000      1102280         6.67
      34.591     0.875000      1134814         8.00
      36.063     0.887500      1150962         8.89
      37.823     0.900000      1167074        10.00
      40.095     0.912500      1183219        11.43
      43.423     0.925000      1199404        13.33
      48.639     0.937500      1215623        16.00
      53.439     0.943750      1223677        17.78
      62.143     0.950000      1231802        20.00
      77.567     0.956250      1239886        22.86
     113.855     0.962500      1247987        26.67
    4210.687     0.968750      1256095        32.00
    6479.871     0.971875      1260163        35.56
    8830.975     0.975000      1264220        40.00
   11182.079     0.978125      1268272        45.71
   13524.991     0.981250      1272389        53.33
   15802.367     0.984375      1276365        64.00
   16990.207     0.985938      1278378        71.11
   18431.999     0.987500      1280427        80.00
   20070.399     0.989062      1282504        91.43
   22200.319     0.990625      1284488       106.67
   24395.775     0.992188      1286522       128.00
   25346.047     0.992969      1287541       142.22
   26558.463     0.993750      1288574       160.00
   27508.735     0.994531      1289539       182.86
   28721.151     0.995313      1290580       213.33
   29704.191     0.996094      1291628       256.00
   30294.015     0.996484      1292076       284.44
   30916.607     0.996875      1292582       320.00
   31260.671     0.997266      1293075       365.71
   31883.263     0.997656      1293610       426.67
   32505.855     0.998047      1294223       512.00
   32784.383     0.998242      1294351       568.89
   33013.759     0.998437      1294585       640.00
   33177.599     0.998633      1294838       731.43
   33439.743     0.998828      1295111       853.33
   33718.271     0.999023      1295349      1024.00
   33816.575     0.999121      1295479      1137.78
   33947.647     0.999219      1295629      1280.00
   34111.487     0.999316      1295769      1462.86
   34144.255     0.999414      1295885      1706.67
   34373.631     0.999512      1295981      2048.00
   34668.543     0.999561      1296082      2275.56
   34799.615     0.999609      1296108      2560.00
   34963.455     0.999658      1296172      2925.71
   35258.367     0.999707      1296230      3413.33
   35323.903     0.999756      1296299      4096.00
   35520.511     0.999780      1296329      4551.11
   35618.815     0.999805      1296398      5120.00
   35618.815     0.999829      1296398      5851.43
   35815.423     0.999854      1296424      6826.67
   35913.727     0.999878      1296477      8192.00
   35913.727     0.999890      1296477      9102.22
   35946.495     0.999902      1296487     10240.00
   36241.407     0.999915      1296547     11702.86
   36241.407     0.999927      1296547     13653.33
   36241.407     0.999939      1296547     16384.00
   36241.407     0.999945      1296547     18204.44
   36241.407     0.999951      1296547     20480.00
   36503.551     0.999957      1296599     23405.71
   36503.551     0.999963      1296599     27306.67
   36503.551     0.999969      1296599     32768.00
   36503.551     0.999973      1296599     36408.89
   36503.551     0.999976      1296599     40960.00
   36503.551     0.999979      1296599     46811.43
   36503.551     0.999982      1296599     54613.33
   36503.551     0.999985      1296599     65536.00
   36503.551     0.999986      1296599     72817.78
   36503.551     0.999988      1296599     81920.00
   36503.551     0.999989      1296599     93622.86
   36503.551     0.999991      1296599    109226.67
   36536.319     0.999992      1296609    131072.00
   36536.319     1.000000      1296609          inf
#[Mean    =      572.582, StdDeviation   =     3384.526]
#[Max     =    36503.552, Total count    =      1296609]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1653359 requests in 1.00m, 3.22GB read
  Socket errors: connect 0, read 2295, write 0, timeout 3
Requests/sec:  27550.39
Transfer/sec:     55.02MB