result/httpaf-fork-lwt.log
Running 1m test @ http://localhost:8000/
  8 threads and 10000 connections
  Thread calibration: mean lat.: 110.824ms, rate sampling interval: 85ms
  Thread calibration: mean lat.: 208.046ms, rate sampling interval: 94ms
  Thread calibration: mean lat.: 200.261ms, rate sampling interval: 93ms
  Thread calibration: mean lat.: 188.155ms, rate sampling interval: 92ms
  Thread calibration: mean lat.: 223.647ms, rate sampling interval: 97ms
  Thread calibration: mean lat.: 225.089ms, rate sampling interval: 96ms
  Thread calibration: mean lat.: 191.256ms, rate sampling interval: 93ms
  Thread calibration: mean lat.: 235.122ms, rate sampling interval: 97ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   804.08ms    3.97s   42.01s    95.67%
    Req/Sec     3.87k   823.51     6.74k    71.66%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   24.19ms
 75.000%   36.51ms
 90.000%   60.61ms
 99.000%   24.15s 
 99.900%   35.32s 
 99.990%   41.48s 
 99.999%   42.04s 
100.000%   42.04s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       6.503     0.000000            1         1.00
      13.391     0.100000       134818         1.11
      16.255     0.200000       269610         1.25
      18.815     0.300000       404614         1.43
      21.375     0.400000       539492         1.67
      24.191     0.500000       674177         2.00
      25.855     0.550000       741514         2.22
      27.727     0.600000       808995         2.50
      29.919     0.650000       876262         2.86
      32.687     0.700000       943396         3.33
      36.511     0.750000      1011172         4.00
      38.879     0.775000      1044449         4.44
      41.695     0.800000      1078121         5.00
      45.151     0.825000      1111999         5.71
      49.055     0.850000      1145571         6.67
      53.951     0.875000      1179231         8.00
      56.991     0.887500      1196078         8.89
      60.607     0.900000      1212958        10.00
      65.663     0.912500      1229840        11.43
      73.407     0.925000      1246555        13.33
      88.895     0.937500      1263426        16.00
     108.735     0.943750      1271831        17.78
    1165.311     0.950000      1280252        20.00
    4534.271     0.956250      1288674        22.86
    7856.127     0.962500      1297107        26.67
   11231.231     0.968750      1305608        32.00
   12869.631     0.971875      1309746        35.56
   14589.951     0.975000      1313969        40.00
   16220.159     0.978125      1318222        45.71
   17874.943     0.981250      1322400        53.33
   19841.023     0.984375      1326586        64.00
   21004.287     0.985938      1328706        71.11
   22233.087     0.987500      1330785        80.00
   23461.887     0.989062      1332906        91.43
   24690.687     0.990625      1335088       106.67
   25903.103     0.992188      1337207       128.00
   26525.695     0.992969      1338251       142.22
   27230.207     0.993750      1339231       160.00
   28180.479     0.994531      1340379       182.86
   29261.823     0.995313      1341348       213.33
   30375.935     0.996094      1342380       256.00
   30965.759     0.996484      1342913       284.44
   31571.967     0.996875      1343438       320.00
   32194.559     0.997266      1343992       365.71
   32817.151     0.997656      1344549       426.67
   33374.207     0.998047      1345104       512.00
   33652.735     0.998242      1345292       568.89
   33947.647     0.998437      1345661       640.00
   34144.255     0.998633      1345795       731.43
   34766.847     0.998828      1346066       853.33
   35356.671     0.999023      1346336      1024.00
   35651.583     0.999121      1346471      1137.78
   36306.943     0.999219      1346581      1280.00
   37224.447     0.999316      1346746      1462.86
   37879.807     0.999414      1346856      1706.67
   38797.311     0.999512      1346997      2048.00
   39059.455     0.999561      1347052      2275.56
   39354.367     0.999609      1347107      2560.00
   39682.047     0.999658      1347186      2925.71
   39976.959     0.999707      1347239      3413.33
   40566.783     0.999756      1347327      4096.00
   40599.551     0.999780      1347351      4551.11
   40894.463     0.999805      1347406      5120.00
   40894.463     0.999829      1347406      5851.43
   41189.375     0.999854      1347437      6826.67
   41484.287     0.999878      1347492      8192.00
   41484.287     0.999890      1347492      9102.22
   41517.055     0.999902      1347516     10240.00
   41517.055     0.999915      1347516     11702.86
   41779.199     0.999927      1347547     13653.33
   41779.199     0.999939      1347547     16384.00
   41811.967     0.999945      1347571     18204.44
   41811.967     0.999951      1347571     20480.00
   41811.967     0.999957      1347571     23405.71
   42008.575     0.999963      1347602     27306.67
   42008.575     0.999969      1347602     32768.00
   42008.575     0.999973      1347602     36408.89
   42008.575     0.999976      1347602     40960.00
   42008.575     0.999979      1347602     46811.43
   42008.575     0.999982      1347602     54613.33
   42041.343     0.999985      1347626     65536.00
   42041.343     1.000000      1347626          inf
#[Mean    =      804.082, StdDeviation   =     3965.342]
#[Max     =    42008.576, Total count    =      1347626]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1707631 requests in 1.00m, 3.33GB read
  Socket errors: connect 0, read 2109, write 0, timeout 0
Requests/sec:  28456.95
Transfer/sec:     56.83MB